## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_key_vault.default will be created
  + resource "azurerm_key_vault" "default" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "dc364229-6dd2-4a2d-b5e8-3f496b04105c"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "afc18075-83a3-471d-9469-5e237208d1f7"
            },
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = (known after apply)
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "afc18075-83a3-471d-9469-5e237208d1f7"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-key-vault"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "s177d01-ntp-pr-2"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + tenant_id                     = "afc18075-83a3-471d-9469-5e237208d1f7"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fatpredisconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpRedis"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.default will be created
  + resource "azurerm_postgresql_flexible_server" "default" {
      + administrator_login           = "fatpadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-psqlflexible-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-2"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + version                       = "14"
    }

  # azurerm_postgresql_flexible_server_configuration.default will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "default" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "CITEXT,UUID-OSSP"
    }

  # azurerm_postgresql_flexible_server_database.default will be created
  + resource "azurerm_postgresql_flexible_server_database" "default" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "find-a-tp-db"
      + server_id = (known after apply)
    }

  # azurerm_redis_cache.default will be created
  + resource "azurerm_redis_cache" "default" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "find-a-tp-redis-cache"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-2"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-2applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = false
          + create = false
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-2httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = false
          + create = false
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.dns_a_record_set.web_app_service_ip_address will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "web_app_service_ip_address" {
      + addrs = (known after apply)
      + host  = (known after apply)
      + id    = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights_standard_web_test.web_app_service[0] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_app_service" {
      + application_insights_id = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Insights/components/find-a-tp-pr-2-insights"
      + description             = "Regional HTTP availability check"
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "emea-se-sto-edge",
          + "emea-nl-ams-azr",
          + "emea-ru-msa-edge",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-2-http"
      + resource_group_name     = "s177d01-ntp-pr-2"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Environment"                                                                                                                                                     = "pr-2"
          + "Product"                                                                                                                                                         = "National Tutoring Programme"
          + "Service Offering"                                                                                                                                                = "National Tutoring Programme"
          + "hidden-link:/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Insights/components/find-a-tp-pr-2-insights" = "Resource"
        }
      + timeout                 = 10

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://find-a-tp-pr-2-cdnendpoint-cpd2cngjemdhesew.z01.azurefd.net/"

          + header {
              + name  = "X-AppInsights-HttpTest"
              + value = "find-a-tp-pr-2-insights"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin.origin[0] will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Cdn/profiles/find-a-tp-pr-2-cdn/originGroups/find-a-tp-pr-2-origingroup"
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "find-a-tp-pr-2origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 500
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_route.route[0] will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Cdn/profiles/find-a-tp-pr-2-cdn/afdEndpoints/find-a-tp-pr-2-cdnendpoint"
      + cdn_frontdoor_origin_group_id = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Cdn/profiles/find-a-tp-pr-2-cdn/originGroups/find-a-tp-pr-2-origingroup"
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "find-a-tp-pr-2route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be created
  + resource "azurerm_linux_web_app" "default" {
      + app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_PROFILERFEATURE_VERSION"             = "1.0.0"
          + "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"             = "1.0.0"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          + "ASPNETCORE_ENVIRONMENT"                          = "Development"
          + "ApplicationInsightsAgent_EXTENSION_VERSION"      = "~2"
          + "BlobStorage_AccountName"                         = "s177p01sharedtpdata"
          + "BlobStorage_ClientId"                            = "fdd09510-77b0-419f-b67c-2b5a25a073f0"
          + "BlobStorage_ContainerName"                       = "ntp-tp-data"
          + "BlobStorage_TenantId"                            = "9c7d9dd3-840c-4b3f-818e-552865082e16"
          + "DiagnosticServices_EXTENSION_VERSION"            = "~3"
          + "EmailSettings_AllSentToEnquirer"                 = "true"
          + "EmailSettings_AmalgamateResponses"               = "true"
          + "FatpAzureKeyVaultName"                           = "find-a-tp-key-vault"
          + "InstrumentationEngine_EXTENSION_VERSION"         = "disabled"
          + "SnapshotDebugger_EXTENSION_VERSION"              = "disabled"
          + "XDT_MicrosoftApplicationInsights_BaseExtensions" = "disabled"
          + "XDT_MicrosoftApplicationInsights_Java"           = "1"
          + "XDT_MicrosoftApplicationInsights_Mode"           = "recommended"
          + "XDT_MicrosoftApplicationInsights_NodeJS"         = "1"
          + "XDT_MicrosoftApplicationInsights_PreemptSdk"     = "disabled"
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "find-a-tp-pr-2"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "s177d01-ntp-pr-2"
      + service_plan_id                   = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Web/serverfarms/find-a-tp-pr-2"
      + site_credential                   = (known after apply)
      + tags                              = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + virtual_network_subnet_id         = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Information"

              + azure_blob_storage {
                  + level             = "Information"
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/"
          + http2_enabled                           = true
          + ip_restriction                          = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = [
                              + "6401a8ea-f76a-448e-8a31-ed46c9570634",
                            ]
                        },
                    ]
                  + name        = "Allow CDN Traffic"
                  + priority    = 65000
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = 2

          + application_stack {
              + dotnet_version = "6.0"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "web_app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-2-webappservice"
      + name                           = "find-a-tp-pr-2-webappservice"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AppServiceAppLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceConsoleLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceHTTPLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceIPSecAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServicePlatformLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Logic/workflows/find-a-tp-pr-2-webhook-workflow|find-a-tp-pr-2-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-2-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.http[0] will be created
  + resource "azurerm_monitor_metric_alert" "http" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when regional availability becomes impacted."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-2-http"
      + resource_group_name      = "s177d01-ntp-pr-2"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-2-actiongroup"
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Insights/components/find-a-tp-pr-2-insights"
          + failed_location_count = 2
          + web_test_id           = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_network_security_group.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_network_security_group" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-2-webappserviceinfransg"
      + resource_group_name = "s177d01-ntp-pr-2"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = (known after apply)
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowFrontdoor"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "AzureFrontDoor.Backend"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet" "web_app_service_infra_subnet" {
      + address_prefixes                               = [
          + "172.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-2-webappserviceinfra"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-2"
      + virtual_network_name                           = "find-a-tp-pr-2-default"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_nat_gateway_association.app_service[0] will be created
  + resource "azurerm_subnet_nat_gateway_association" "app_service" {
      + id             = (known after apply)
      + nat_gateway_id = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Network/natGateways/find-a-tp-pr-2-default"
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_network_security_group_association.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_route_table_association.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet_route_table_association" "web_app_service_infra_subnet" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/53a57159-e3b8-49b4-8b5e-367eab190ad1/resourceGroups/s177d01-ntp-pr-2/providers/Microsoft.Network/routeTables/find-a-tp-pr-2-default"
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] will be created
  + resource "azurerm_virtual_network" "default" {
      + address_space       = [
          + "172.0.0.0/12",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-2-default"
      + resource_group_name = "s177d01-ntp-pr-2"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment"      = "pr-2"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

Plan: 19 to add, 1 to change, 0 to destroy.
```
</details>